<a href="https://colab.research.google.com/github/JONAHKYAGABA/Flutter-Tutorials/blob/master/titanic%20dataset%20training.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
import pandas as pd
import sklearn
import pickle
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
df=pd.read_csv('train.csv')
df = pd.read_csv("train.csv")

In [41]:
df

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,0,22.0,1,0,7.2500,0,0
1,2,1,1,1,38.0,1,0,71.2833,1,2
2,3,1,3,1,26.0,0,0,7.9250,0,1
3,4,1,1,1,35.0,1,0,53.1000,0,2
4,5,0,3,0,35.0,0,0,8.0500,0,0
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,0,27.0,0,0,13.0000,0,5
887,888,1,1,1,19.0,0,0,30.0000,0,1
888,889,0,3,1,28.0,1,2,23.4500,0,1
889,890,1,1,0,26.0,0,0,30.0000,1,0
890,891,0,3,0,32.0,0,0,7.7500,2,0

In [30]:


def get_title(name):
    if '.' in name:
        return name.split(',')[1].split('.')[0].strip()
    else:
        return 'Unknown'
def replace_titles(x):
    title = x['Title']
    if title in ['Capt', 'Col', 'Major']:
        return 'Officer'
    elif title in ["Jonkheer","Don",'the Countess', 'Dona', 'Lady',"Sir"]:
        return 'Royalty'
    elif title in ['the Countess', 'Mme', 'Lady']:
        return 'Mrs'
    elif title in ['Mlle', 'Ms']:
        return 'Miss'
    else:
        return title
df['Title'] = df['Name'].map(lambda x: get_title(x))

In [32]:

df['Title'] = df.apply(replace_titles, axis=1)
df['Age'].fillna(df['Age'].median(), inplace=True)
df['Fare'].fillna(df['Fare'].median(), inplace=True)
df['Embarked'].fillna("S", inplace=True)
df.Sex.replace(("male","female"),(0,1),inplace=True)
df.Embarked.replace(('S','C','Q'),(0,1,2),inplace=True)
df.Title.replace(('Mr','Miss','Mrs','Master','Dr','Rev','Officer','Royalty'),(0,1,2,3,4,5,6,7),inplace=True)
y=df['Survived']

In [35]:
df.drop("Cabin",axis=1,inplace=True)

In [36]:
df.drop("Name",axis=1,inplace=True)

In [38]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Title          0
dtype: int64

In [42]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Fare           float64
Embarked         int64
Title            int64
dtype: object

In [40]:
df.drop("Ticket",axis=1,inplace=True)

In [43]:


from sklearn.model_selection import train_test_split
x=df.drop(['Survived','PassengerId'],axis=1)
y=df["Survived"]
x_train, x_val,y_train,y_val = train_test_split(x,y,test_size=0.1)
#training the machine learning model



randomforest = RandomForestClassifier(max_depth=2, random_state=0)
randomforest.fit(x_train,y_train)
y_pred = randomforest.predict(x_val)
acc_randomforest = round(accuracy_score(y_pred,y_val)*100,2)
print(acc_randomforest) 

pickle.dump(randomforest,open('titanic_model.sav' , 'wb'))

80.0